# YOLOv8-GhostNet with BiFPN-Lite and CARAFE
# Parameters
nc: 80 # number of classes

scales:
  n: [0.33, 0.40, 1024]  # 调整宽度因子保留更多特征
anchors: [[3,4,5,6,7,8], [9,10,12,14,15,18]]  # 仅保留P3/P4对应锚框

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, GhostConv, [64, 3, 1]]        # 0-P1/2 (调整stride为1保留细节)
  - [-1, 1, GhostConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C3Ghost, [128]]            #2

  - [-1, 1, ECA, [128]]                # 3-添加通道+空间注意力
  - [-1, 1, C2f_OD, [256, 3, 2]]  # 4-P3/8   #256out
  - [-1, 3, C3Ghost, [256]]         #5
  - [[-1, 2], 1, Concat, [1]]          # 6-跳跃连接融合浅层特征


  - [-1, 1, GhostConv, [512, 3, 1]]  # 7-保持高分辨率  out512
  - [-1, 1, GhostConv, [512, 3, 2]]  # 8-P4/16    128*128
  - [-1, 3, C3Ghost, [512]]         #9

  #- [-1, 1, GhostConv, [1024, 3, 2]] # 10-P5/32
  #- [-1, 3, C3Ghost, [1024]] #11
  - [-1, 1, SPPF, [512]]   #10
# Head
head:
  # ----- 上采样路径 -----
  - [-1, 1, nn.Upsample, [None, 1, "nearest"]]#13           *256*256
  - [[-1, 8], 1, BiFPN_Concat2, [1]]#14
  - [-1, 3, C3Ghost, [256]]#15

  - [-1, 1, CARAFE, [3,5]]           # 16
  - [[-1, 5], 1, Concat, [1]]      #17
  - [-1, 3, C3Ghost, [128]]                  #18
  - [-1, 1, ECA, [128]]                 # 19-P2检测层

  # ----- 下采样路径 -----
  - [-1, 1, GhostConv, [128, 3, 2]]    #20
  - [[-1, 13], 1, Concat, [1]] #21
  - [-1, 3, C3Ghost, [256]]          #22

  #- [-1, 1, GhostConv, [512, 3, 2]]  #2
  #- [[-1, 10], 1, BiFPN_Concat2, [1]] #24
  #- [-1, 3, C3Ghost, [1024]]  #25

  # 检测层
  - [[17, 20, 10], 1, Detect, [nc]]  # 启用解耦头