# YOLOv8-GhostNet with BiFPN-Lite and CARAFE
# Parameters
nc: 1 # number of classes

scales:
  n: [0.33, 0.35, 1024]  # 调整宽度因子保留更多特征
anchors: [[3,4, 5,6, 7,8], [9,10, 12,14, 15,18], [19,20, 24,28, 32,36]]  # 三级密集锚框

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 1]]        # 0-P1/2 (调整stride为1保留细节)
  - [-1, 1, GhostConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C3Ghost, [128]]            #2

  - [-1, 1, ECA, [128]]                # 3-添加通道+空间注意力
  - [-1, 1, GhostConv, [256, 3, 2]]  # 4-P3/8   #256out
  - [-1, 6, C3Ghost, [256]]         #5


  - [-1, 1, GhostConv, [512, 3, 1]]  # 6-保持高分辨率  out512
  - [-1, 1, GhostConv, [512, 3, 2]]  # 7-P4/16
  - [-1, 6, C3Ghost, [512]]         #8

  - [-1, 1, GhostConv, [1024, 3, 2]] # 9-P5/32   out1024
  - [-1, 3, C3Ghost, [1024]] #10
  - [-1, 1, SPPFCSPC, [1024,5]]   #11

head:
  # ----- 上采样路径 -----
  - [-1, 1, CARAFE, [3,5]]           # 12
  - [[-1, 8], 1, BiFPN_Concat2, [1]]#13
  - [-1, 3, C3Ghost, [512]]#14

  - [-1, 1, CARAFE, [3,5]]           # 15
  - [[-1, 5], 1, Concat, [1]]      #16
  - [-1, 3, C3Ghost, [256]]                  #17
  - [-1, 1, ECA, [256]]                 # 18-P2检测层

  # ----- 下采样路径 -----
  - [-1, 1, GhostConv, [256, 3, 2]]    #19
  - [[-1, 14], 1, Concat, [1]] #20
  - [-1, 3, C3Ghost, [512]]          #21

  - [-1, 1, GhostConv, [512, 3, 2]]  #22
  - [[-1, 11], 1, Concat, [1]] #23
  - [-1, 3, C3Ghost, [1024]]  #24

  # 检测层
  - [[18, 21,24], 1, Detect, [nc]]  # 启用解耦头